---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeLibrary.Dispose
source: html/fb175e54-120e-39c0-3a9f-ddf74f7f14fc.htm
---
# Autodesk.Revit.DB.DirectShapeLibrary.Dispose Method

Releases all resources used by the DirectShapeLibrary

## Syntax (C#)
```csharp
public void Dispose()
```